/******************************************************************************
* File : BobbyUtil.h
*
* Desc : 각종 잡다한 계산을 해주는 모듈. -_-;;;
*
* 073002. Bob Jung
******************************************************************************/

#ifndef __BOBBY_UTIL_H__
#define __BOBBY_UTIL_H__

extern RwV3d GetIntersection(RwV3d start, RwV3d end, RwV3d* tri);
extern int   FindIntersectionNearVertex(RwLine *pLine , RwV3d* tri);

#endif

/******************************************************************************
******************************************************************************/